[
    {
        "id": 1,
        "title": "Ayat al-Kursi: The Greatest Protection",
        "arabic_text": "أَعُوْذُ بِاللّٰهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ. اَللّٰهُ لَآ إِلٰهَ إِلَّا هُوَ الْحَىُّ الْقَيُّوْمُ ، لَا تَأْخُذُهُۥ سِنَةٌ وَّلَا نَوْمٌ ، لَهُ مَا فِى السَّمٰـوٰتِ وَمَا فِى الْأَرْضِ ، مَنْ ذَا الَّذِىْ يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِۦ ، يَعْلَمُ مَا بَيْنَ أَيْدِيْهِمْ وَمَا خَلْفَهُمْ ، وَلَا يُحِيْطُوْنَ بِشَىْءٍ مِّنْ عِلْمِهِٓ إِلَّا بِمَا شَآءَ ، وَسِعَ كُرْسِيُّهُ السَّمٰـوٰتِ وَالْأَرْضَ، وَلَا يَئُوْدُهُۥ حِفْظُهُمَا ، وَهُوَ الْعَلِىُّ الْعَظِيْمُ.",
        "transliteration": "Aʿūdhu bi-llāhi mina-sh-Shayṭāni-r-rajīm. Allāhu lā ilāha illā Huwa-l-Ḥayyu-l-Qayyūm, lā ta’khudhuhū sinatuw-wa lā nawm, lahū mā fi-s-samāwāti wa mā fi-l-arḍ, man dhā’lladhī yashfaʿu ʿindahū illā bi-idhnih, yaʿlamu mā bayna aydīhim wa mā khalfahum, wa lā yuḥīṭūna bi-shay’im-min ʿilmihī illā bi-mā shā’, wasiʿa kursiyyuhu-s-samāwāti wa-l-arḍ, wa lā ya’ūduhū ḥifẓuhumā wa Huwa-l-ʿAlliyu-l-ʿAẓīm.",
        "english_translation": "I seek the protection of Allah from the accursed Shayṭān. Allah, there is no god worthy of worship but He, the Ever Living, The Sustainer of all. Neither drowsiness overtakes Him nor sleep. To Him Alone belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except with His permission? He knows what is before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursī extends over the heavens and the earth, and their preservation does not tire Him. And He is the Most High, the Magnificent. (2:255)",
        "categories": ["Morning Adhkar", "Protection"],
        "reference": "Ḥākim 2064",
        "benefits": "Ubayy b. Kaʿb (raḍiy Allāhu ʿanhu) reported that he had a vessel in which he kept dates. He found that its quantity was decreasing. So he kept guard on it one night and saw a creature that resembled an adolescent boy. Ubayy greeted him and he returned his greeting. Ubayy then asked him, “What are you, a jinnī or a human?” He replied, “A jinnī.” So he said to him, “Show me your hand.” So he showed him his hand, and it looked like a dog’s paw with dog’s fur. He said, “This is how the jinn are created. The jinn know that there is no one amongst them who is stronger than me.” Ubayy asked him, “What caused you to do what you did?” He replied, “We heard that you are a man who loves charity, and we came to take our share from your food.’” Ubayy asked him, “What will protect us from you?” He replied, “Reading Āyah al-Kursī from Sūrah al-Baqarah [i.e. the verse above]. If you read it in the morning, you will be protected from us till the evening. And if you read it in the evening, you will be protected from us till the morning.” Ubayy said: “The following morning, I went to the Messenger of Allah ﷺ and told him about what had happened. The Messenger of Allah ﷺ said, “The evil one spoke the truth.”",
        "recitation_count": 1
    },
    {
        "id": 2,
        "title": "3 Quls: Be Sufficed in All Your Matters",
        "arabic_text": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ. قُلْ هُوَ اللّٰهُ أَحَدٌ ، اَللّٰهُ الصَّمَدُ ، لَمْ يَلِدْ وَلَمْ يُوْلَدْ ، وَلَمْ يَكُنْ لَّهُ كُفُوًا أَحَدٌ. بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ. قُلْ أَعُوْذُ بِرَبِّ الْفَلَقِ ، مِنْ شَرِّ مَا خَلَقَ ، وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ، وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ، وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ. بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ. قُلْ أَعُوْذُ بِرَبِّ النَّاسِ ، مَلِكِ النَّاسِ ، إِلٰهِ النَّاسِ ، مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ، اَلَّذِيْ يُوَسْوِسُ فِيْ صُدُوْرِ النَّاسِ ، مِنَ الْجِنَّةِ وَالنَّاسِ.",
        "transliteration": "Bismi-llāhi-r-Raḥmāni-r-Raḥīm. Qul Huwa-llāhu Aḥad. Allāhu-ṣ-Ṣamad. Lam yalid wa lam yūlad. Wa lam yakul-lahū kufuwan aḥad. Bismi-llāhi-r-Raḥmāni-r-Raḥīm. Qul aʿūdhu bi-Rabbi-l-falaq. Min sharri mā khalaq. Wa min sharri ghāsiqin idhā waqab. Wa min sharri-n-naffāthāti fi-l-ʿuqad. Wa min sharri ḥāsidin idhā ḥasad. Bismi-llāhi-r-Raḥmāni-r-Raḥīm. Qul aʿūdhu bi-Rabbi-n-nās. Maliki-n-nās. Ilāh-hin-nās. Min sharri-l-waswāsi-l-khannās. Al-ladhī yuwaswisu fī ṣudūri-n-nās. Mina-l-jinnati wa-n-nās.",
        "english_translation": "In the name of Allah, the All-Merciful, the Very Merciful. Say, He is Allah, the One, the Self-Sufficient Master, Who has not given birth and was not born, and to Whom no one is equal. (112) In the name of Allah, the All-Merciful, the Very Merciful. Say, I seek protection of the Lord of the daybreak, from the evil of what He has created, and from the evil of the darkening night when it settles, and from the evil of the blowers in knots, and from the evil of the envier when he envies. (113) In the name of Allah, the All-Merciful, the Very Merciful. Say, I seek protection of the Lord of mankind, the King of mankind, the God of mankind, from the evil of the whisperer who withdraws, who whispers in the hearts of mankind, whether they be Jinn or people. (114)",
        "categories": ["Morning Adhkar", "Protection"],
        "reference": "Tirmidhī 3575",
        "benefits": "Muʿādh b. ʿAbdullāh b. Khubaib, narrated from his father (raḍiy Allāhu ‘anhu), who said: “We went out on a rainy and extremely dark night, looking for the Messenger of Allah ﷺ, so that he could lead us in Salāh.” He said: “So I met him and he ﷺ said: ‘Say’ but I did not say anything. Then he ﷺ said: ‘Say.’ But I did not say anything. He ﷺ said: ‘Say.’ So I said: ‘What should I say?’ He ﷺ said: “Recite Sūrah al-Ikhlās and al-Mu’awwidhatayn (Sūrah al-Falaq and Sūrah al-Nās) three times in the morning and the evening. It will suffice you in all respects.” ‘It will suffice you in all respects’ means it will protect you from all evil.",
        "recitation_count": 3
    },
    {
        "id": 3,
        "title": "Sayyid al-Istighfar: The Best Way of Seeking Forgiveness",
        "arabic_text": " اَللّٰهُمَّ أَنْتَ رَبِّيْ لَا إِلٰهَ إِلَّا أَنْتَ ، خَلَقْتَنِيْ وَأَنَا عَبْدُكَ ، وَأَنَا عَلَىٰ عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوْءُ لَكَ بِذَنْبِيْ ، فَاغْفِرْ لِيْ فَإِنَّهُ لَا يَغْفِرُ الذُّنُوْبَ إِلَّا أَنْتَ.",
        "transliteration": "Allāhumma Anta Rabbī, lā ilāha illā Ant, khalaqtanī wa ana ʿabduk, wa ana ʿalā ʿahdika wa waʿdika mā’staṭaʿt, aʿūdhu bika min sharri mā ṣanaʿt, abū’u laka bi niʿmatika ʿalayya wa abū’u laka bi-dhambī fa-ghfir lī fa-innahū lā yaghfiru-dh-dhunūba illā Ant.",
        "english_translation": "O Allah, You are my Lord. There is no god worthy of worship except You. You have created me, and I am Your slave, and I am under Your covenant and pledge (to fulfil it) to the best of my ability. I seek Your protection from the evil that I have done. I acknowledge the favours that You have bestowed upon me, and I admit my sins. Forgive me, for none forgives sins but You.",
        "categories": ["Morning Adhkar", "Forgiveness"],
        "reference": "Bukhārī 6306",
        "benefits": "Shaddād b. Aws (raḍiy Allāhu ʿanhu) narrates that the Messenger of Allah ﷺ said: “The most superior manner of seeking forgiveness is that you say [the above]. Whoever says it during the day with firm belief in it and dies on the same day before the evening, he will be from the people of Paradise. And whoever says it during the night with firm belief in it and dies before the morning, he will be from the people of Paradise.”",
        "recitation_count": 1
    },
    {
        "id": 4,
        "title": "Protect Yourself From Anxiety, Laziness, Debt etc",
        "arabic_text": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ ، وَأَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ ، وَأَعُوْذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.",
        "transliteration": "Allāhumma innī aʿūdhu bika min-l-hammi wa-l-ḥazan, wa aʿūdhu bika min-l-ʿajzi wa-l-kasal, wa aʿūdhu bika min-l-jubni wa-l-bukhl, wa aʿūdhu bika min ghalabati-d-dayni wa qahri-r-rijāl.",
        "english_translation": "O Allah, I seek Your protection from anxiety and grief. I seek Your protection from inability and laziness. I seek Your protection from cowardice and miserliness, and I seek Your protection from being overcome by debt and being overpowered by men.",
        "categories": ["Morning Adhkar", "Protection"],
        "reference": "Abū Dāwūd 1555",
        "benefits": "Abū Saʿīd al-Khudrī (raḍiy Allāhu ʿanhu) narrated that one day, the Messenger of Allah ﷺ entered the masjid. He saw a man from the Anṣār called Abū Umāmah (raḍiy Allāhu ʿanhu). He ﷺ asked, “What is the matter? Why are you sitting in the mosque when it is not the time for prayer?” He replied, “Never-ending worries and debts, O Messenger of Allah.” The Messenger of Allah ﷺ then asked, “Shall I not teach you words by which, when you say them, Allah will remove your worries, and settle your debts?” He replied, “Yes of course, O Messenger of Allah.” He ﷺ said, “Say in the morning and evening [the above].” Abū Umāmah (raḍiy Allāhu ʿanhu) said, “Then I did that, and Allah removed my worries and settled my debts.”",
        "recitation_count": 1
    },
    {
        "id": 5,
        "title": "Well-being in this World and the Hereafter",
        "arabic_text": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِيْ دِيْنِيْ وَدُنْيَايَ وَأَهْلِيْ وَمَالِيْ ، اَللّٰهُمَّ اسْتُرْ عَوْرَاتِيْ وَآمِنْ رَوْعَاتِيْ ، اَللّٰهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِيْ ، وَعَنْ يَّمِيْنِيْ ، وَعَنْ شِمَالِيْ ، وَمِنْ فَوْقِيْ ، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيْ.",
        "transliteration": "Allāhumma innī as’aluka-l-ʿāfiyata fi-d-dunyā wa-l-ākhirah. Allāhumma innī as’aluka-l-ʿafwa wa-l-ʿāfiyata fī dīnī wa dunyāya wa ahlī wa mālī, Allāhumma-stur ʿawrātī wa āmin rawʿātī. Allāhumma-ḥfaẓnī mim bayni yadayya wa min khalfī, wa ʿay-n yamīnī wa ʿan shimālī wa min fawqī, wa aʿūdhu bi-ʿaẓamatika an ughtāla min taḥtī.",
        "english_translation": "O Allah, I ask You for well-being in this world and the next. O Allah, I ask You for forgiveness and well-being in my religion, in my worldly affairs, in my family and in my wealth. O Allah, conceal my faults and calm my fears. O Allah, guard me from in front of me and behind me, from my right, and from my left, and from above me. I seek protection in Your Greatness from being unexpectedly destroyed from beneath me.",
        "categories": ["Morning Adhkar", "Well-being"],
        "recitation_count": 1
    },
    {
        "id": 6,
        "title": "Protect Yourself From the 4 Evils",
        "arabic_text": "اَللّٰهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ ، فَاطِرَ السَّمٰوَاتِ وَالْأَرْضِ ، رَبَّ كُلِّ شَيْءٍ وَمَلِيْكَهُ ، أَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا أَنْتَ ، أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِيْ ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلَىٰ نَفْسِيْ سُوْءًا ، أَوْ أَجُرَّهُ إِلَىٰ مُسْلِمٍ.",
        "transliteration": "Allāhumma ʿālima-l-ghaybi wa-sh-shahādah, fāṭir-as-samāwāti wa-l-arḍi, rabba kulli shay’iw-wa malīkah, ash-hadu al-lā ilāha illā Anta, aʿūdhu bika min sharri nafsī wa min sharri-sh-shayṭāni wa shirkihī wa an aqtarifa ʿalā nafsī sū’an aw ajurrahū ilā muslim.",
        "english_translation": "O Allah, Knower of the unseen and the seen, Creator of the heavens and the earth, the Lord and Sovereign of everything; I bear witness that there is no god worthy of worship but You. I seek Your protection from the evil of my own self, from the evil of Shayṭān and from the evil of polytheism to which he calls,and from inflicting evil on myself, or bringing it upon a Muslim.",
        "categories": ["Morning Adhkar", "Protection"],
        "reference": "Tirmidhī 3392, 3529",
        "benefits": "Abū Bakr al-Ṣiddīq (raḍiy Allāhu ʿanhu) said: “O Messenger of Allah, instruct me what to say in morning and in the evening.” He said: “Say [the above].” (Composite: Tirmidhī 3392, 3529)",
        "recitation_count": 1
    },
    {
        "id": 7,
        "title": "Entrust All Your Matters to Allah",
        "arabic_text": "يَا حَيُّ يَا قَيُّوْمُ ، بِرَحْمَتِكَ أَسْتَغِيْثُ ، أَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ ، وَلَا تَكِلْنِيْ إِلَىٰ نَفْسِيْ طَرْفَةَ عَيْنٍ.",
        "transliteration": "Yā Ḥayyu yā Qayyūm, bi-raḥmatika astaghīth, aṣliḥ lī sha’nī kullah, wa lā takilnī ilā nafsī ṭarfata ʿayn.",
        "english_translation": "O The Ever Living, The Sustainer of all. ; I seek assistance through Your mercy. Rectify all of my affairs and do not entrust me to myself for the blink of an eye.",
        "categories": ["Morning Adhkar", "Guidance"],
        "reference": "Nasā’ī in ʿAmal al-Yawm wa-l-Laylah 570",
        "benefits": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said to Fāṭimah (raḍiy Allāhu ʿanhā), “What is preventing you from (doing) what I am advising you; that you say [the above] in the morning and evening?”",
        "recitation_count": 1
    },
    {
        "id": 8,
        "title": "Fulfil Your Obligation to Thank Allah",
        "arabic_text": "اَللّٰهُمَّ مَا أَمْسَى بِيْ مِنْ نِّعْمَةٍ أَوْ بِأَحَدٍ مِّنْ خَلْقِكَ ، فَمِنْكَ وَحْدَكَ لَا شَرِيْكَ لَكَ ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ.",
        "transliteration": "Allāhumma mā aṣbaḥa bī min niʿmatin aw bi-aḥadim-min khalqik, fa-minka waḥdaka lā sharīka lak, fa laka-l-ḥamdu wa laka-sh-shukr.",
        "english_translation": "O Allah, all the favours that I or anyone from Your creation has received in the morning, are from You Alone. You have no partner. To You Alone belong all praise and all thanks.",
        "categories": ["Morning Adhkar", "Gratitude"],
        "reference": "Abū Dāwūd 5073",
        "benefits": "ʿAbdullāh b. Ghannām (raḍiy Allāhu ‘anhu) narrates that the Messenger of Allah ﷺ said: “Whoever says [the above] in the morning has fulfilled his obligation to thank Allah for that day. And whoever says it in the evening has fulfilled his obligation for that night.”",
        "recitation_count": 1
    },
    {
        "id": 9,
        "title": "Start Your Evening by Renewing Tawhid",
        "arabic_text": "أَمْسَيْنَا عَلَىٰ فِطْرَةِ الْإِسْلَامِ ، وَعَلَىٰ كَلِمَةِ الْإِخْلَاصِ ، وَعَلَىٰ دِيْنِ نَبِيِّنَا مُحَمَّدٍ ، وَعَلَىٰ مِلَّةِ أَبِيْنَا إِبْرَاهِيْمَ حَنِيْفًا مُّسْلِمًا وَّمَا كَانَ مِنَ الْمُشْرِكِيْنَ.",
        "transliteration": "Amsaynā ʿalā fiṭrati-l-islām, wa ʿalā kalimati-l-ikhlāṣ, wa ʿalā dīni Nabiyyinā Muḥammadin ṣallallāhu ʿalayhi wa sallam, wa ʿalā millati abīnā Ibrāhīma ḥanīfam-muslima, wa mā kāna mina-l-mushrikīn.",
        "english_translation": "We have entered the evening upon the natural religion of Islam, the statement of pure faith (i.e. Shahādah), the religion of our Prophet Muhammad ﷺ and upon the way of our father Ibrāhīm, who turned away from all that is false, having surrendered to Allah, and he was not of the polytheists.",
        "categories": ["Evening Adhkar", "Tawhid"],
        "reference": "Aḥmad 15360",
        "benefits": "ʿAbd al-Raḥmān b. Abzā (raḍiy Allāhu ʿanhu) narrates that the Prophet ﷺ said [the above].",
        "recitation_count": 1
    },
    {
        "id": 10,
        "title": "Start the Evening by Praising Allah",
        "arabic_text": "أَمْسَيْتُ أُثْنِيْ عَلَيْكَ حَمْدًا ، وَأَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا اللّٰهُ.",
        "transliteration": "Amsaytu uthnī ʿalayka ḥamdā, wa ash-hadu al-lā ilāha illāl-llāh.",
        "english_translation": "I have entered the evening praising You, and I bear witness that there is no god worthy of worship but Allah.",
        "categories": ["Evening Adhkar", "Praise"],
        "reference": "Nasā’ī in Sunan al-Kubrā 10406",
        "benefits": "Abū Hurayrah (raḍiy Allāhu ʿanhu) narrated that the Messenger of Allah ﷺ said: “When one of you enters the morning, they should say [the above] three times. And when they enter the evening, they should say the same.”",
        "recitation_count": 3
    },
    {
        "id": 11,
        "title": "Ask Allah for a Good Evening",
        "arabic_text": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلّٰهِ وَالْحَمْدُ لِلّٰهِ ، لَا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيْكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ ، وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيْرٌ ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِيْ هٰذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِيْ هٰذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا ، رَبِّ أَعُوْذُ بِكَ مِنَ الْكَسَلِ وَسُوْءِ الْكِبَرِ ، رَبِّ أَعُوْذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ.",
        "transliteration": "Amsaynā wa amsa-l-mulku li-llāh, wa-l-ḥamdu li-llāh, lā ilāha illa-llāhu waḥdahū lā sharīka lah, lahu-l-mulku wa lahu-l-ḥamd, wa huwa ʿalā kulli shay’in Qadīr, Rabbi as’aluka khayra mā fī hādhihi-l-laylati wa khayra mā baʿdah, wa aʿūdhu bika min sharri mā fī hādhihi-l-laylati wa sharri mā baʿdah. Rabbi aʿūdhu bika mina-l-kasali wa sū’i-l-kibar, Rabbi aʿūdhu bika min ʿadhābin fi-n-nāri wa ʿadhābin fi-l-qabr.",
        "english_translation": "We have entered the evening and at this very time the whole kingdom belongs to Allah. All praise is due to Allah. There is no god worthy of worship except Allah, the One; He has no partner with Him. The entire kingdom belongs solely to Him, to Him is all praise due, and He is All-Powerful over everything. My Lord, I ask You for the good that is in this night and the good that follows it, and I seek Your protection from the evil that is in this night and from the evil that follows it. My Lord, I seek Your protection from laziness and the misery of old age. My Lord, I seek Your protection from the torment of the Hell-fire and the punishment of the grave.",
        "categories": ["Evening Adhkar", "Blessing"],
        "reference": "Muslim 2723",
        "benefits": "ʿAbdullāh b. Masʿūd (raḍiy Allāhu ʿanhu) narrates that when the Messenger of Allah ﷺ used to enter the evening, he would say [the above].",
        "recitation_count": 1
    },
    {
        "id": 12,
        "title": "Ask Allah to Bless Your Evening",
        "arabic_text": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ خَيْرَ هٰذِهِ اللَّيْلَةِ ، فَتْحَهَا وَنَصْرَهَا وَنُوْرَهَا وَبَرَكَتَهَا وَهُدَاهَا ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِيْهَا وَشَرِّ مَا بَعْدَهَا.",
        "transliteration": "Amsaynā wa amsa-l-mulku li-llāhi Rabbi-l-ʿālamīn, Allāhumma innī as’aluka khayra hādhihi-l-laylah, fatḥahā wa naṣrahā wa nūrahā wa barakatahā wa hudāhā, wa aʿūdhu bika min sharri mā fīhā wa sharri mā baʿdahā.",
        "english_translation": "We have entered the evening and at this very time the whole kingdom belongs to Allah, Lord of the Worlds. O Allah, I ask You for the goodness of this night: its victory, its help, its light, and its blessings and guidance. I seek Your protection from the evil that is in it and from the evil that follows it.",
        "categories": ["Evening Adhkar", "Blessing"],
        "reference": "Abū Dāwūd 5084",
        "benefits": "Abū Mālik al-Ashʿarī (raḍiy Allāhu ʿanhu) narrates that the Messenger of Allah ﷺ said: “When one of you enters the morning, they should say [the above]; and when they reach the evening, they should say the same.”",
        "recitation_count": 1
    },
    {
        "id": 13,
        "title": "Get Yourself Freed from the Hell-fire",
        "arabic_text": "اَللّٰهُمَّ إِنِّيْ أَمْسَيْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلَائِكَتَكَ وَجَمِيْعَ خَلْقِكَ ، أَنَّكَ أَنْتَ اللّٰهُ لَا إِلٰهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُوْلُكَ.",
        "transliteration": "Allāhumma innī amsaytu ush-hiduka, wa ush-hidu ḥamlata ʿarshika, wa malā’ikatika, wa jamī’a khalqika, annaka Anta-llāhu lā ilāha illā Anta waḥdak, lā sharīka lak, wa an-na Muḥammadan ʿabduka wa rasūluk.",
        "english_translation": "O Allah, I have entered the evening, and I call upon You, the bearers of Your Throne, Your angels and all creation, to bear witness that surely You are Allah. There is no god worthy of worship except You Alone. You have no partners, and that Muḥammad ﷺ is Your slave and Your Messenger.",
        "categories": ["Evening Adhkar", "Salvation"],
        "reference": "Abū Dāwūd 5069, Abū Dāwūd 5078",
        "benefits": "Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Messenger of Allah ﷺ said: “Whosoever reads [the above] in the morning or evening once, Allah frees a quarter of him from the Hell-fire. If he reads it twice, Allah frees half of him from the Hell-fire. If he reads it thrice, Allah frees three-quarters of him from the Hell-fire. And if he reads it four times, Allah (completely) frees him from the Hell-fire.” Anas b. Mālik (raḍiy Allāhu ʿanhu) narrates that the Messenger of Allah ﷺ said: “Whoever says the above in the morning, Allah will forgive the sins he commits in that day; and whoever says it in the evening, Allah will forgive the sins he commits in that night.”",
        "recitation_count": 4
    },
    {
        "id": 14,
        "title": "Upon Entering the Evening",
        "arabic_text": "اَللّٰهُمَّ بِكَ أَمْسَيْنَا وَبِكَ أَصْبَحْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوْتُ وَإِلَيْكَ الْمَصِيْرُ.",
        "transliteration": "Allāhumma bika amsaynā wa bika aṣbaḥnā wa bika naḥyā wa bika namūtu wa ilayka-l-maṣīr.",
        "english_translation": "O Allah, by You we have entered the evening and by You we enter upon the morning. By You, we live and we die, and to You is the return.",
        "categories": ["Evening Adhkar"],
        "reference": "Al-Adab al-Mufrad 1199",
        "benefits": "Abū Hurayrah (raḍiy Allāhu ʿanhu) narrated that the Messenger of Allah ﷺ used to say [the above] when he would enter the evening.”",
        "recitation_count": 1
    },
    {
        "id": 15,
        "title": "Ask Allah For Good Health and Protection",
        "arabic_text": "اَللّٰهُمَّ عَافِنِيْ فِيْ بَدَنِيْ ، اَللّٰهُمَّ عَافِنِيْ فِيْ سَمْعِيْ ، اَللّٰهُمَّ عَافِنِيْ فِيْ بَصَرِيْ ، لَا إِلٰهَ إِلَّا أَنْتَ ، اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلٰهَ إِلَّا أَنْتَ.",
        "transliteration": "Allāhumma ʿāfinī fī badanī, Allāhumma ʿāfinī fī samʿī, Allāhumma ʿāfinī fī baṣarī, lā ilāha illā Ant, Allāhumma innī aʿūdhu bika mina-l-kufri wa-l-faqr, wa aʿūdhu bika min ʿadhābi-l-qabr, lā ilāha illā Ant.",
        "english_translation": "O Allah, grant me well-being in my body. O Allah, grant me well-being in my hearing. O Allah, grant me well-being in my sight. There is no god worthy of worship except You. O Allah, I seek Your protection from disbelief and poverty and I seek Your protection from the punishment of the grave. There is no god worthy of worship except You.",
        "categories": ["Morning Adhkar", "Health", "Protection"],
        "reference": "Abū Dāwūd 5090, Aḥmad 20430",
        "benefits": "‘Abd al-Raḥmān b. Abī Bakrah (raḍiy Allāhu ʿanhu) narrates that he said to his father, “O my father! I hear you supplicating with [the above] every morning. You repeat them three times in the morning and three times in the evening.” He said, “Indeed I heard the Messenger of Allah ﷺ supplicating with these (words) and I love to follow his practice.”",
        "recitation_count": 3
    },
    {
        "id": 16,
        "title": "Allah Will Suffice You in Everything",
        "arabic_text": "حَسْبِيَ اللّٰهُ لَا إِلٰهَ إِلَّا هُوَ ، عَلَيْهِ تَوَكَّلْتُ ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيْمِ.",
        "transliteration": "Ḥasbiya-Allāhu lā ilāha illā Huwa, ʿalayhi tawakkaltu, wa Huwa Rabbu-l-ʿArshi-l-ʿaẓīm.",
        "english_translation": "Allah is sufficient for me. There is no god worthy of worship except Him. I have placed my trust in Him only and He is the Lord of the Magnificent Throne.",
        "categories": ["Morning Adhkar", "Sufficiency"],
        "reference": "Ibn al-Sunnī 71",
        "benefits": "Abū al-Dardā’ (raḍiy Allāhu ʿanhu) narrates from the Messenger of Allah ﷺ that he said: “Whoever recites [the above] seven times in the morning and in the evening, Allah will suffice him in everything that concerns him in matters of this world and the next.”",
        "recitation_count": 7
    },
    {
        "id": 17,
        "title": "Have the Prophet ﷺ Hold Your Hand and Admit You to Paradise",
        "arabic_text": "رَضِيْتُ بِاللّٰهِ رَبًّا ، وَبِالْإِسْلَامِ دِيْنًا ، وَبِمُحَمَّدٍ نَّبِيًّا.",
        "transliteration": "Raḍītu bi-llāhi Rabbā, wa bi-l-islāmi dīnā, wa bi Muḥammadin-Nabiyyā.",
        "english_translation": "I am pleased with Allah as my Lord, with Islām as my religion and with Muḥammad ﷺ as my Prophet.",
        "categories": ["Morning Adhkar", "Paradise"],
        "reference": "Aḥmad 18927, Ṭabarānī: al-Muʿjam al-Kabīr 838, Muslim 1884",
        "benefits": "Thawbān (raḍiy Allāhu ʿanhu) narrates that the Messenger of Allah ﷺ said: “Allah has promised that anyone who says [the above] three times every morning and evening will be pleased on the Day of Judgement.” The Messenger of Allah ﷺ said: “Whoever says [the above] in the morning, I guarantee that I will take hold of his hand until I enter him into Paradise.” Abū Saʿīd al-Khudrī narrates that the Messenger of Allah ﷺ said: “Abū Sa’īd, whoever is pleased with Allah as his Lord, Islam as his religion and Muḥammad as his Prophet will be guaranteed entry into Paradise.” He (Abū Saʿīd) was amazed and said: “O Messenger of Allah, repeat it for me.” He (the Messenger of Allah ﷺ) did that and then said: “There is another act which elevates the position of a man in Paradise one hundred grades (higher); and the distance between one grade and the other is like the distance between the sky and the earth.” He (Abū Saʿīd) said: “What is that act, O Messenger of Allah?” He replied: “Striving in the path of Allah! Striving in the path of Allah!”",
        "recitation_count": 3
    },
    {
        "id": 18,
        "title": "Protect Yourself From All Harm",
        "arabic_text": "بِسْمِ اللّٰهِ الَّذِيْ لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ ، وَهُوَ السَّمِيْعُ الْعَلِيْمُ.",
        "transliteration": "Bismi-llāhi-lladhī lā yaḍurru maʿasmihi shay’un fi-l-arḍi wa lā fi-s-samā’, wa Huwa-s-Samīʿu-l-ʿAlīm.",
        "english_translation": "In the Name of Allah, with whose Name nothing can harm in the earth nor in the sky. He is The All-Hearing and All-Knowing.",
        "categories": ["Morning Adhkar", "Protection"],
        "reference": "Tirmidhī 3388, Abū Dāwūd 5088",
        "benefits": "Abān b. ʿUthmān narrated from ʿUthmān b. ʿAffān (raḍiy Allāhu ʿanhu) who mentioned that the Messenger of Allah ﷺ said: “There is no servant who says [the above] three times every morning and evening, except that nothing will harm him.” Abān himself had been afflicted with a form of paralysis, so the man began to look at him. Abān said to him: “Why do you look at me? The ḥadīth is as I have narrated it to you, except that I did not recite it one day, and Allah brought about His decree upon me.” The Messenger of Allah ﷺ said: “Whoever says [the above] three times (in the evening), they will not be afflicted by a sudden calamity till the morning. And whoever says it three times in the morning, they will not be afflicted with a sudden calamity until the evening.”",
        "recitation_count": 3
    },
    {
        "id": 19,
        "title": "Get Your Sins Forgiven",
        "arabic_text": "سُبْحَانَ اللّٰهِ وَبِحَمْدِهِ.",
        "transliteration": "Subḥāna-llāhi wa bi ḥamdih.",
        "english_translation": "Allah is free from imperfection, and all praise is due to Him.",
        "categories": ["Morning Adhkar", "Forgiveness"],
        "reference": "Muslim 2692, Bukhārī 6405, Tirmidhī 3464",
        "benefits": "Abū Hurayrah (raḍiy Allāhu ʿanhu) narrates that the Messenger of Allah ﷺ said: “He who recites [the above] in the morning and in the evening 100 times, will not be surpassed on the Day of Judgement by anyone with better deeds except the one who says the same words or more.” Abū Hurayrah (raḍiy Allāhu ʿanhu) narrates that the Messenger of Allah ﷺ said: “Whoever says [the above] 100 times a day, all of his sins will be forgiven, even if they are as abundant as the foam of the sea.” He ﷺ also said: “Whoever says سُبْحَانَ اللهِ وَبِحَمْدِه, a palm-tree will be planted for him in Paradise.”",
        "recitation_count": 100
    },
    {
        "id": 20,
        "title": "An Unparalleled Reward",
        "arabic_text": "لَا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيْكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ ، وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيْرٌ.",
        "transliteration": "Lā ilāha illā-Allāh, waḥdahū lā sharīka lah, lahu-l-mulk, wa lahu-l-ḥamd, wa Huwa ʿalā kulli shay’in Qadīr.",
        "english_translation": "There is no god worthy of worship except Allah. He is Alone and He has no partner whatsoever. To Him Alone belong all sovereignty and all praise. He is over all things All-Powerful.",
        "categories": ["Morning Adhkar", "Reward"],
        "reference": "Bukhārī 3293, Nasā’ī in al-Sunan al-Kubrā 10410",
        "benefits": "Abū Hurayrah (raḍiy Allāhu ʿanhu) narrates that the Messenger of Allah ﷺ said: “He who says [the above] 100 times in a day will have a reward equivalent to that of freeing 10 slaves. A 100 good deeds will be recorded to his credit, and a 100 of his sins will be blotted out from his scroll. He will be safeguarded against Shayṭān on that day till the evening; and none will surpass him in doing better good deeds except someone who has recited these words more often than him.” The Messenger of Allah ﷺ said: “Whoever says [the above] 100 times in the morning and evening, none will surpass him in doing better good deeds except someone who has recited it more than him.”",
        "recitation_count": 100
    },
    {
        "id": 21,
        "title": "Tasbih, Tahmid and Takbir",
        "arabic_text": "سُبْحَانَ اللّٰهِ ، اَلْحَمْدُ لِلّٰهِ ، اَللّٰهُ أَكْبَرُ.",
        "transliteration": "Subḥāna-llāh, Alḥamdu li-llāh, Allāhu akbar.",
        "english_translation": "Allah is free from imperfection. All praise be to Allah. Allah is the Greatest.",
        "categories": ["Morning Adhkar", "Praise"],
        "reference": "Nasā’ī: al-Sunan al-Kubrā 10657",
        "benefits": "ʿAmr b. Shuʿayb narrates from his father who narrates from his grandfather that the Messenger of Allah ﷺ said: “He who says ‘Subḥānallāh’ 100 times before sunrise and 100 times before sunset, it will be better than 100 camels. He who says ‘Alḥamdullilāh’ 100 times before sunrise and 100 times before sunset, it will be better than 100 horses on which he sends 100 warriors. He who says ‘Allāhu Akbar’ 100 times before sunrise and 100 times before sunset, it will be better than freeing 100 slaves.”",
        "recitation_count": 100
    },
    {
        "id": 22,
        "title": "Receive the Intercession of the Prophet ﷺ",
        "arabic_text": "اَللّٰهُمَّ صَلِّ عَلَىٰ مُحَمَّدٍ وَّعَلَىٰ اٰلِ مُحَمَّدٍ ، كَمَا صَلَّيْتَ عَلَىٰ إِبْرَاهِيْمَ وَعَلَىٰ اٰلِ إِبْرَاهِيْمَ ، إِنَّكَ حَمِيْدٌ مَّجِيْدٌ ، اَللّٰهُمَّ بَارِكْ عَلَىٰ مُحَمَّدٍ وَّعَلَىٰ اٰلِ مُحَمَّدٍ ، كَمَا بَارَكْتَ عَلَىٰ إِبْرَاهِيْمَ وَعَلَىٰ اٰلِ إِبْرَاهِيْمَ ، إِنَّكَ حَمِيْدٌ مَّجِيْدٌ.",
        "transliteration": "Allāhumma ṣalli ʿalā Muḥammad wa ʿalā āli Muḥammad, kamā ṣallayta ʿalā Ibrāhīma wa ʿalā āli Ibrāhīm, innaka Ḥamīdu-m-Majīd, Allāhumma bārik ʿalā Muḥammad, wa ʿalā āli Muḥammad, kamā bārakta ʿalā Ibrāhīma wa ʿalā āli Ibrāhīm, innaka Ḥamīdu-m-Majīd.",
        "english_translation": "O Allah, honour and have mercy upon Muhammad and the family of Muhammad as You have honoured and had mercy upon Ibrāhīm and the family of Ibrāhīm. Indeed, You are the Most Praiseworthy, the Most Glorious. O Allah, bless Muhammad and the family of Muhammad as You have blessed Ibrāhīm and the family of Ibrāhīm. Indeed, You are the Most Praiseworthy, the Most Glorious.",
        "categories": ["Morning Adhkar", "Salawat"],
        "reference": "Ṭabarānī: al-Muʿjam al-Kabīr 6357",
        "benefits": "Abū al-Dardā (raḍiy Allāhu ʿanhu) narrates that the Messenger of Allah ﷺ said: “Whoever sends ṣalāh upon me 10 times in the morning and 10 times in the evening will receive my intercession.”",
        "recitation_count": 10
    },
    {
        "id": 23,
        "title": "Seek Forgiveness and Repent",
        "arabic_text": "أَسْتَغْفِرُ اللّٰهَ وَأَتُوْبُ إِلَيْهِ.",
        "transliteration": "Astaghfiru-l-llāha wa atūbu ilayh.",
        "english_translation": "I seek Allah’s forgiveness and turn to Him in repentance.",
        "categories": ["Morning Adhkar", "Forgiveness"],
        "reference": "Ṭabarānī: al-Muʿjam al-Awsaṭ 3879",
        "benefits": "Burdah (raḍiy Allāhu ʿanhu) narrated that we (the companions) were seated when the Messenger of Allah ﷺ came. He said: “No morning has passed by except that I have sought Allah’s forgiveness in it a 100 times.”",
        "recitation_count": 100
    },
    {
        "id": 25,
        "title": "Protection from all Evil",
        "arabic_text": "أَعُوْذُ بِكَلِمَاتِ اللّٰهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ.",
        "transliteration": "Aʿūdhu bi kalimāti-l-llāhi-t-tāmmāti min sharri mā khalaq.",
        "english_translation": "I seek protection in Allah’s perfect words from the evil of whatever He has created.",
        "categories": ["Evening Adhkar", "Protection"],
        "reference": "Tirmidhī 3604",
        "benefits": "Abū Hurayrah (raḍiy Allāhu ‘anhu) narrates that the Messenger of Allah ﷺ said: “Whoever recites [the above] three times in the evening will not be harmed by insect stings in that night.” Suhayl (a narrator) said: “So our family used to learn it and they used to say it every night. A girl among them was stung, and she did not feel any pain.”",
        "recitation_count": 3
    }
]